# -*- coding: utf-8 -*-
"""
Created on Mon Nov  6 10:59:56 2023

@author: allen

給定一個正整數數字，輸出該數字高度的數字型直角三角形。
例如，輸入5，則輸出

1
12
123
1234
12345

以此類推，但若超過2位數，僅取其個位數來處理。

輸入說明
輸入一個正整數

輸出說明
輸出該數字高度的數字型直角三角形

範例輸入 #1
1
範例輸出 #1
1
範例輸入 #2
5
範例輸出 #2
1
12
123
1234
12345
範例輸入 #3
20
範例輸出 #3
1
12
123
1234
12345
123456
1234567
12345678
123456789
1234567890
12345678901
123456789012
1234567890123
12345678901234
123456789012345
1234567890123456
12345678901234567
123456789012345678
1234567890123456789
12345678901234567890

"""

x = int(input())
for i in range(1,x+1):
    for j in range(1,i+1):
        print(j%10, end = "")
    print()