# -*- coding: utf-8 -*-
"""
Created on Thu Nov  9 14:32:56 2023

@author: allen


有一天在夢中遇見一位全身發光的外星人想要教我他們的記數方法,
他們的世界裡是使用類似象形的文字來處理,例如,
0:.:
  ::
1::.
  ::
2:::
  :.
3:::
  .:
4::.
  .:
5:::
  ..
6::.
  ..
其標記是以順時針方式查看,如下數字表示順序,每個數字都有上下兩個符號組成。
01
32
所以,標記:表示無值,標記.表示有值,例如,
.:
::表示0
::
..表示3+2=5

輸入說明
輸入某一整數

輸出說明
輸出外星數字表示方式

範例輸入
023
3251
範例輸出
 0  2  3
.: :: ::
:: :. .:
3251
 3  2  5  1
:: :: :: :.
.: :. .. ::

"""
#       0     1     2     3     4     5     6
l = [['.:', ':.', '::', '::', ':.', '::', ':.'],
     ['::', '::', ':.', '.:', '.:', '..', '..']]

while (1):
    try:
        x = input()
        n = int(x)
        print(" ", end = "")
        print(*x, sep = "  ")
        for i in range(len(x)):
            if (i == len(x)-1):
                print(l[0][int(x[i])], end = "")
                
            else:
                print(l[0][int(x[i])], end = " ")
        print()
        for i in range(len(x)):
            if (i == len(x)-1):
                print(l[1][int(x[i])], end = "")
            else:
                print(l[1][int(x[i])], end = " ")
        print()
    except:
        break