# -*- coding: utf-8 -*-
"""
Created on Mon Nov 13 08:52:45 2023

@author: allen

有人說物理的極致是宗教，數學的極致是哲學，是有一定道理的。
難怪有人會如此醉心於數學，每年的3/14是國際數學日，請看有趣的算式。

1 x 9 + 2 = 11
12 x 9 + 3 = 111
123 x 9 + 4 = 1111
1234 x 9 + 5 = 11111
12345 x 9 + 6 = 111111
123456 x 9 + 7 = 1111111
1234567 x 9 + 8 = 11111111
12345678 x 9 + 9 = 111111111
123456789 x 9 + 10 = 1111111111

請試著寫個程式試試看嚕~~~

輸入說明
輸入一個介於1至9的正整數

輸出說明
輸出該數字與該數字減一與加一後的運算式與結果，但大於9與小於1的數字不會被輸出。請注意格式化。

範例輸入 #1
1
範例輸出 #1
1         x 9 +  2 = 11        
12        x 9 +  3 = 111       
範例輸入 #2
4
範例輸出 #2
123       x 9 +  4 = 1111      
1234      x 9 +  5 = 11111     
12345     x 9 +  6 = 111111    
範例輸入 #3
9
範例輸出 #3
12345678  x 9 +  9 = 111111111 
123456789 x 9 + 10 = 1111111111

"""

x = int(input())
if (x == 1):
    print("1         x 9 +  2 = 11        ")
    print("12        x 9 +  3 = 111       ")
elif (x == 9):
    print("12345678  x 9 +  9 = 111111111 ")
    print("123456789 x 9 + 10 = 1111111111")
else:
    for i in range(x,(x+3)):
        print(*range(1,i), " " * (11-i), "x 9 + %2d = " %i, "1" * i, " " * (10-i), sep = "")